{"_type":"all","didUMean":"","totalCount":1839,"relatedSearch":["**equity bank utb**","**neutral deutsche bank**","**bilingual job fair canada**","**neutral dz bank**","**canada wide science fair**","**equities national bank financial**","**credit home equity bank loans**","**capital group global equity fund canada**","**equity refinance canada**","**neutral rating dz bank**","**neutral bank of america**","**standard chartered bank online equities**"],"value":[{"id":"5391332159563541815","title":"Equity Bank | Uganda High Commission Canada | /visituganda.com/","url":"http://visituganda.com/menu/category/what-to-see/uganda-high-commission-canada/equity-bank","description":"UTB","body":"Consulate Of  Uganda In Australia\nConsulate of  Uganda in Australia\nEmbassy Of Uganda In Abu Dhabi, United Arab Emirates\nEmbassy of Uganda in Abu Dhabi, United Arab Emirates\nConsulate Of Uganda In Port-of-Spain, Trinidad And Tobago\nConsulate of Uganda in Port-of-Spain, Trinidad and Tobago\nEmbassy Of Uganda In Ankara, Turkey\nEmbassy of Uganda in Ankara, Turkey\nUgandan Embassy In Juba, South Sudan\nUgandan Embassy in Juba, South Sudan\nEmbassy Of Uganda In Mogadishu, Somalia\nEmbassy of Uganda in Mogadishu, Somalia\nEmbassy Of Uganda In Tripoli\nEmbassy of Uganda in Tripoli","snippet":"Consulate Of Uganda In Australia Consulate of Uganda in Australia Embassy Of Uganda In Abu Dhabi, United Arab Emirates Embassy of Uganda in Abu Dhabi, United Arab Emirates Consulate Of Uganda In Port-of-Spain, Trinidad And Tobago Consulate of Uganda in Port-of-Spain, Trinidad and Tobago Embassy Of Uganda In Ankara, Turkey Embassy of Uganda in Ankara, Turkey Ugandan Embassy In Juba, South Sudan Ugandan Embassy in Juba, South Sudan Embassy Of Uganda In Mogadishu, Somalia Embassy of Uganda in Mogadishu, Somalia Embassy Of Uganda In Tripoli Embassy of Uganda in Tripoli.","keywords":"","language":"en","isSafe":true,"datePublished":"0001-01-01T00:00:00","provider":{"name":"visituganda","favIcon":"","favIconBase64Encoding":""},"image":{"url":"","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"visituganda","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://visituganda.com/menu/category/what-to-see/uganda-high-commission-canada/equity-bank"}},{"id":"1055935690624287628","title":"Equitable Group Inc, EQB:TOR profile - FT.com","url":"http://markets.ft.com/data/equities/tearsheet/profile?s=eqb:tor","description":"Equitable Group Inc (EQB:TOR) company profile with history, revenue, mergers & acquisitions, peer analysis, institutional shareholders and more.","body":"Profile data is unavailable for this security.\nAbout the company\nEquitable Group Inc. is a Canada-based company that is engaged in financial services business. The Company operates through its wholly-owned subsidiary, Equitable Bank. It serves retail and commercial customers across Canada with a range of savings solutions and lending products, offered under the Equitable Bank and EQ Bank brands. Its retail lending includes alternative single family lending and\nprime single family residential lending. Its commercial lending products includes commercial mortgage lending and insured multi-unit residential lending. It also serves the Canadian equipment leasing market through its subsidiary, Bennington Financial Corp. (Bennington). Bennington finances a range of assets with a focus on transportation, construction and food service equipment.\nRevenue in CAD (TTM)","snippet":"It serves retail and commercial customers across **Canada** with a range of savings solutions and lending products, offered under the **Equitable Bank** and EQ **Bank** brands. Its retail lending includes alternative single family ...","keywords":"","language":"en","isSafe":true,"datePublished":"0001-01-01T00:00:00","provider":{"name":"ft","favIcon":"","favIconBase64Encoding":""},"image":{"url":"","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"ft","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://markets.ft.com/data/equities/tearsheet/profile?s=eqb:tor"}},{"id":"3284966611237563485","title":"Equitable (NYSE:EQH) Given New $28.00 Price Target at Royal Bank of Canada - Community Financial News","url":"https://www.com-unik.info/2023/04/11/equitable-nyseeqh-given-new-28-00-price-target-at-royal-bank-of-canada.html","description":"Read Equitable (NYSE:EQH) Given New $28.00 Price Target at Royal Bank of Canada at Community Financial News","body":"Get Rating\n) last announced its quarterly earnings results on Wednesday, February 8th. The company reported $1.11 EPS for the quarter, missing the consensus estimate of $1.29 by ($0.18). The business had revenue of $1.90 billion for the quarter, compared to analyst estimates of $3.27 billion. The firms quarterly revenue was down 48.3% on a year-over-year basis. During the same quarter in the prior year, the firm posted $1.54 EPS.  On average, research analysts predict that  Equitable will post 5.69 EPS for the current fiscal year.\nEquitable Announces Dividend\nThe firm also recently announced a quarterly dividend, which was paid on Monday, March 6th. Shareholders of record on Monday, February 27th were given a dividend of $0.20 per share. The ex-dividend date of this dividend  was Friday, February 24th. This represents a $0.80 annualized dividend and a dividend yield of 3.26%. Equitables dividend payout ratio (DPR) is presently 18.26%.\nInsider Activity\nIn related news, CAO William James Iv Eckert sold 8,100 shares of the firms stock in a transaction that occurred on Wednesday, March 22nd. The stock was sold at an average price of $25.38, for a total transaction of $205,578.00. Following the completion of the sale, the chief accounting officer now directly owns 27,062 shares of the companys stock, valued at approximately $686,833.56. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. In other news, Director Kristi Ann Matus sold 19,297 shares of the firms stock in a transaction that occurred on Friday, March 24th. The shares were sold at an average price of $23.34, for a total transaction of $450,391.98. The sale was disclosed in a document filed with the SEC, which is available through the SEC website. Also, CAO William James Iv Eckert sold 8,100 shares of Equitable stock in a transaction that occurred on Wednesday, March 22nd. The shares were sold at an average price of $25.38, for a total transaction of $205,578.00. Following the sale, the chief accounting officer now directly owns 27,062 shares of the companys stock, valued at approximately $686,833.56. The disclosure for this sale can be found here. Insiders own  0.98% of the companys stock.\nInstitutional Inflows and Outflows\nInstitutional investors have recently bought and sold shares of the company. CWM LLC increased its stake in shares of  Equitable by 29.6% during the third quarter. CWM LLC now owns 1,501 shares of the companys stock valued at $40,000 after buying an additional 343 shares during the period.  EverSource Wealth Advisors LLC increased its position in  Equitable by 80.9% during the 3rd quarter. EverSource Wealth Advisors LLC now owns 1,588 shares of the companys stock valued at $43,000 after purchasing an additional 710 shares during the period.  Belpointe Asset Management LLC bought a new stake in shares of  Equitable in the 4th quarter valued at about $67,000.  Romano Brothers AND Company bought a new stake in shares of  Equitable in the 4th quarter valued at about $79,000.  Finally, Fifth Third Bancorp lifted its position in shares of  Equitable by 91.3% in the 3rd quarter. Fifth Third Bancorp now owns 3,334 shares of the companys stock worth $88,000 after purchasing an additional 1,591 shares during the period. 93.17% of the stock is currently owned by hedge funds and other institutional investors.\nEquitable Company Profile","snippet":"Read **Equitable** (NYSE:EQH) Given New $28.00 Price Target at Royal **Bank** of **Canada** at Community Financial News. Get Rating ) last announced its quarterly earnings results on Wednesday, February 8th.","keywords":"","language":"en","isSafe":true,"datePublished":"2023-04-11T08:20:43","provider":{"name":"com-unik","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/equitable-holdings-inc-logo.png?v=20221107192253&amp;w=240&amp;h=240&amp;zc=2","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"com-unik","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.com-unik.info/2023/04/11/equitable-nyseeqh-given-new-28-00-price-target-at-royal-bank-of-canada.html"}},{"id":"5029664169032178346","title":"Equitable Bank reports strong mortgage growth in Q3, but expects \"downshift\" into 2023 - Mortgage Rates & Mortgage Broker News in Canada","url":"https://www.canadianmortgagetrends.com/2022/11/equitable-bank-reports-strong-mortgage-growth-in-q3-but-expects-downshift-into-2023/","description":"In the face of a slowing housing market, Equitable Bank reported strong third-quarter earnings results.","body":"Equitable Bank reports strong mortgage growth in Q3, but expects downshift into 2023\nIn the face of a slowing housing market, Equitable Bank reported strong third-quarter earnings results.\nThe banknow the seventh-largest independent bank in Canadasaw conventional loan growth increase 29% year-over-year, slightly off the 36% year-over-year growth rate reported in Q2. By comparison, however, both Home Capital and First National reported year-over-year decreases in originations in Q3.\nWeve reinforced that EQBs operating model is designed to perform across economic cycles, and this resilience translated again in Q3, said President and CEO Andrew Moor. The balance sheet, credit and capital are well-positioned, diversified and performing to plan. Combined with our teams exceptional focus on ROE and margin management, we believe 2022 will close out on track or ahead of guidance, and we will enter 2023 from a point of strength.\nMoor acknowledged activity is expected to slow into the first half of the year, but that the underlying demand is being deferred, likely until the second half of 2023.\nBut we certainly [see] houses [being] purchased, theres always demand as people get into the housing formation stage of their life, [as] children arrive, [as] they need to buy a bigger house with another bedroom and so on, Moor said. So really, were going to see a little bit of deferred activity in the housing market, and we are anticipating by the end of next year well be back to a more normal cadence.\nEquitable also finalized its $200-million acquisition of Saskatchewan-based Concentra Bank, which was first announced in February. That brings Equitable to more than $100 billion in combined assets under management.\nHighlights from the Q3 earnings report\nNet income: $187 million (+24% YoY)\nAssets under administration: $47.3 billion (+18%)\nConventional loan originations: $25.1 billion (+29%)\nSingle-family alternative portfolio: $16.5 billion (+24%)\nNet interest margin: 1.94% (+11 bps)\nReverse mortgage loans: $514 million (+194%)\nNotables from its call\nCEO Andrew Moor commented on the following topics during the companys earnings call:\nOn the potential for an increase in defaults: As a reminder, the key driver of default is unemployment. Tilting the economy into recession could change the picture. But with a million jobs going unfilled, increasing immigration targets from the federal government, and our emphasis on urban centres where employment source is diverse [provides] strong downside protection.\nOn average loan-to-values (LTVs): Even with recent house price declines, the average LTV on our uninsured single-family portfolio of 63% provides a very comfortable cushion.\nOn extending amortizations: So, first of all, were not doing that. We dont offer mortgages over 30 yearsWe are seeing participants in the market extending amortization in order to make mortgages more affordable. That doesnt seem prudent, frankly, to us, and its not a road weve chosen to go down, although there is competitive pressure there, but just doesnt feel sensible.\nOn Equitables reverse mortgage portfolio: The fact that our 2023 guidance shows 60% to 80% expansion in the reverse mortgage portfolio simply underscores the tremendous growth potential of this franchise.\nOn the finalization of the Concentra acquisition: Our top priority is optimizing [and] differentiating value to credit unions and to the more than five million members they serve, while integrating Concentra to achieve all of the scale of synergy benefits communicated last FebruaryIve been busy working on the phones reaching out to thetraditional partners of Concentra. And I would say theres general support for the transaction. In some quarters, theres obviously some skepticism about a Toronto-based bank buying a Prairie bank with a long and storied history in the credit union system. So, I think some are watching us. Weve got to walk the walk and make sure that we deliver against the commitments that were making to people. And Im committed to doing that.\nSource:\nNote: Transcripts are provided as-is from the companies and/or third-party sources, and their accuracy cannot be 100% assured.\nGet The Latest News\nJoin our mailing list to receive the latest news and updates as they happen. Unsubscribe any time.","snippet":"... face of a slowing housing market, **Equitable Bank** reported strong third-quarter earnings results. **Equitable Bank** ... the face of a slowing housing market, **Equitable Bank** reported strong third-quarter earnings results.","keywords":"","language":"en","isSafe":true,"datePublished":"2022-11-18T02:35:58","provider":{"name":"canadianmortgagetrends","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://cdn.canadianmortgagetrends.com/wp-content/uploads/2022/11/Equitable-Bank-Q3-earnings_med.jpg","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"canadianmortgagetrends","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.canadianmortgagetrends.com/2022/11/equitable-bank-reports-strong-mortgage-growth-in-q3-but-expects-downshift-into-2023/"}},{"id":"3606855886069822530","title":"Canada Banks Brief: Equitable Bank Also Increasing Its Prime Lending Rate by 75 BPS to 5.45%, Effective September 8, 2022 | MarketScreener","url":"http://4-traders.com/quote/stock/bank-of-montreal-1409224/news/canada-banks-brief-equitable-bank-also-increasing-its-prime-lending-rate-by-75-bps-to-5-45-effect-41717836/","description":"| September  9,  2022","body":"Canada Banks Brief: Equitable Bank Also Increasing Its Prime Lending Rate by 75 BPS to 5.45%, Effective September 8, 2022\n09/07/2022 | 04:55pm EDT","snippet":"**Canada Banks** Brief: **Equitable** Bank Also Increasing Its Prime Lending Rate by 75 BPS to 5.45%, Effective September 8, 2022 09/07/2022.","keywords":"","language":"en","isSafe":true,"datePublished":"2022-09-07T20:55:01","provider":{"name":"4-traders","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.marketscreener.com/images/twitter_MS_fdblanc.png","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"4-traders","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://4-traders.com/quote/stock/bank-of-montreal-1409224/news/canada-banks-brief-equitable-bank-also-increasing-its-prime-lending-rate-by-75-bps-to-5-45-effect-41717836/"}},{"id":"5790371248960245625","title":"Bank of Canada rate hikes to sting many home equity borrowers | Reuters","url":"http://reuters.com/markets/us/bank-canada-rate-hikes-sting-many-home-equity-borrowers-2022-07-26/","description":"Canadians whose use of home equity lines of credit (HELOC) has climbed recently following a surge in real estate values during the pandemic could be hit by the next central bank interest-rate hike, which should double monthly payments from just a few months ago.","body":"read more\nWhile delinquencies have remained low, at around 0.16% of HELOC balances, they could rise as rates increase further, Oakes said. Stress tests and lending standards mitigate the risk, but the number of Canadians with multiple mortgages rose during the pandemic, up 7.5% in the first quarter from two years ago, according to Equifax. Those with more than four mortgages jumped 17.5%.\nCanadians can use HELOCs to fund most of the downpayments on investment properties, although data was not available on what proportion of buyers do this.\nMortgage broker Ron Butler cited a client who used a HELOC on his primary home during the pandemic to fund the downpayment on an investment property, then borrowed against that. Now, since the last rate hike, he is looking at a monthly loss of C$600 on rent alone, excluding other expenses.\nStill, unlike variable-rate mortgages, HELOCs only require interest payments. This keeps monthly payments fairly low, making increases manageable for many borrowers, said Moody's Investors Service Senior Credit Officer Rob Colangelo. Still, rising rates could lift delinquencies above pre-pandemic levels, he added.\nThe monthly payment on a C$100,000 HELOC is around C$400. Most HELOC balances are below this level, said mortgage strategist Rob McLister. HELOCs are repaid during a repayment period that follows the draw period.\n\"Arrears will definitely tick higher in the next year but it would take an extraordinary increase in unemployment, now at a record low, to push defaults to worrisome levels,\" he said.\n\"I'd peg the chances of more than 1% of HELOC borrowers defaulting at roughly 1 in 100.\"\nRegister now for FREE unlimited access to Reuters.com\nRegister\nReporting By Nichola Saminather; Editing by David Gregorio\nOur Standards:","snippet":"... credit (HELOC) has climbed recently following a surge in real estate values during the pandemic could be hit by the next central **bank** interest-rate hike, which should double monthly payments from just a few months ago.","keywords":"","language":"en","isSafe":true,"datePublished":"2022-07-26T16:28:46","provider":{"name":"reuters","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.reuters.com/resizer/0ht_DADpha_1tKypnvWXB-3PdrY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/2KAN3VCPZFL3DH23R4IVP6KAR4.jpg","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"reuters","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://reuters.com/markets/us/bank-canada-rate-hikes-sting-many-home-equity-borrowers-2022-07-26/"}},{"id":"1348837585975489675","title":"Equitable launches digital bank with 3% interest savings account to lure deposits from Canadian rivals | Financial Post","url":"https://financialpost.com/news/fp-street/equitable-launches-digital-bank-with-3-interest-savings-account-to-lure-deposits-from-canadian-rivals","description":"Equitable started signing up customers this week for its EQ Bank, allowing daily transactions including bill payments, e-transfers and moving money via computer or mobile phone","body":"This advertisement has not loaded yet, but your article continues below.\nArticle content continued\nDigital Way\nAnybody that offers a savings account could potentially be a competitor, Moor, 55, said. Were certainly looking for people that are concerned about returns on their money and people that embrace the digital way of living.\nING Groep NV pioneered online banking in Canada with ING Direct in 1998. Scotiabank, the countrys third-largest lender by assets, bought the business for $3.1 billion in 2012 and renamed it Tangerine. Other online lenders, including PC Financial and Manulife Financial Corp.s Manulife Bank, followed. The Internet is now the main means of banking for 55 per cent of Canadians, according to the Canadian Bankers Association.\nEquitable Bank, with assets of $14.8 billion as of Sept. 30, makes most of its profit from single-family mortgages, commercial lending and financing of government-insured apartment buildings. The Toronto-based lender, a unit of Equitable Group Inc., also offers guaranteed investment certificates and a high-interest savings account, and as of Sept. 30 had $8 billion in deposits.","snippet":"**Equitable** started signing up customers this week for its EQ **Bank**, allowing daily transactions including bill payments, e-transfers and moving money via computer or mobile phone.\nING Groep NV pioneered online banking in **Canada** with ING Direct in 1998.","keywords":"","language":"en","isSafe":true,"datePublished":"2022-06-08T04:47:00","provider":{"name":"financialpost","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://financialpostcom.files.wordpress.com/2016/01/eq-bank.jpg","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"financialpost","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://financialpost.com/news/fp-street/equitable-launches-digital-bank-with-3-interest-savings-account-to-lure-deposits-from-canadian-rivals"}},{"id":"5215600213464553633","title":"Equitable signs $370.26m deal to buy Canadian digital bank Concentra","url":"https://www.verdict.co.uk/equitable-digital-bank-concentra/","description":"Equitable Bank announced the signing of an agreement to acquire a majority stake in Canadas Concentra Bank for $370.26m.","body":"updated 09 Feb 2022 12:33pm\nEquitable signs deal to buy Canadian digital bank Concentra for $370.26m\nCanadian lender Equitable Bankhas signed agreements to acquire domestic digital rival Concentra Bank for C$470m ($370.26m).\nThe deal is aimed at accelerating the growth and diversification of Equitable Bank and will add an asset base of around C$11.3bn ($8.9bn) along with scale in core product lines.\nEquitable will acquire Credit Union Central of Saskatchewans (SaskCentral) 84% common share equity interest in Concentra. It has also signed support agreements to buy a majority of the remaining 16% stake from additional Concentra shareholders.\nEquitable president and CEO Andrew Moor said: Acquiring Concentra strengthens Equitables position as Canadas Challenger Bank by adding scale, talent, customer and partner relationships that will allow us to better serve our purpose of driving change in Canadian banking that enriches peoples lives.\nThis is one of the most important and consequential transaction in our 50 plus history, and it accelerates our growth plan by several years.\nThe addition of Concentra elevates Equitables place among the countrys top-tier financial institutions, expands our core markets of Personal and Commercial banking including alternative, reverse single-family mortgage loans, commercial lending and equipment leasing, and furthers our standing relationship with credit unions with whom we share a strong philosophical bond.\nHeadquartered in Saskatoon, Concentra is a digital bank, which operates under the trade name Wyth Financial.\nContent from our partners\nFiber for All: Expanding Role of FTP\nThe Hub71 effect: Delivering continued success for innovators and investors\nService-level analytics as a foundation of 5G Enterprise Services\nIt caters to retail and businesses with a range of services including savings and mortgages. It also provides fintechs with banking as a service.\nAdditionally, Concentra is one of the largest providers of wholesale banking and trust solutions to Canadian credit unions.\nConcentra president and CEO Don Coulter said: We are delighted to join Equitable in its challenger bank quest. This powerful combination of capabilities and services is right for our employees, customers and community partners and creates an opportunity for our team to excel as part of an award-winning Canadian bank that shares our commitment to innovation.\nThe board of directors of Equitable, Concentra, and SaskCentral have approved the acquisition.\nThe deal now awaits regulatory approval and is expected to close in the second half of 2022.\nEquitable Bank will fund the purchase through C$200m ($157.53m) of new equity to be secured through a bought deal offering of subscription receipts.\nThe remainder will be funded through a credit facility from a group led by TD Securities and RBC Capital Markets.\nMore of this topic","snippet":"**Equitable Bank** announced the signing of an agreement to acquire a majority stake in **Canadas** Concentra **Bank** for $370.26m.\nupdated 09 Feb 2022 12:33pm **Equitable** signs deal to buy Canadian digital bank Concentra for $370.26m Canadian lender **Equitable Bank**has signed agreements to acquire domestic digital rival Concentra **Bank** for C$470m ($370.26m).","keywords":"","language":"en","isSafe":true,"datePublished":"2022-02-08T12:31:00","provider":{"name":"verdict","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.verdict.co.uk/wp-content/uploads/2022/02/laptop-g37c334030_1280-1038x778.png","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"verdict","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.verdict.co.uk/equitable-digital-bank-concentra/"}},{"id":"4170704711821637099","title":"Equitable signs $370.26m deal to buy Canadian digital bank Concentra","url":"https://www.retailbankerinternational.com/news/equitable-digital-bank-concentra/","description":"Equitable Bank announced the signing of an agreement to acquire a majority stake in Canadas Concentra Bank for $370.26m.","body":"February 8, 2022\nEquitable signs deal to buy Canadian digital bank Concentra for $370.26m\nCanadian lender Equitable Bank has signed agreements to acquire domestic digital rival Concentra Bank for C$470m ($370.26m).\nThe deal is aimed at accelerating the growth and diversification of Equitable Bank and will add an asset base of around C$11.3bn ($8.9bn) along with scale in core product lines.\nEquitable will acquire Credit Union Central of Saskatchewans (SaskCentral) 84% common share equity interest in Concentra. It has also signed support agreements to buy a majority of the remaining 16% stake from additional Concentra shareholders.\nEquitable president and CEO Andrew Moor said: Acquiring Concentra strengthens Equitables position as Canadas Challenger Bank by adding scale, talent, customer and partner relationships that will allow us to better serve our purpose of driving change in Canadian banking that enriches peoples lives.\nRelated\nGerman fintech Vivid Money raises $114m at $886m valuation\nDeal News\nFiserv signs deal to acquire remaining stake in Finxact for $650m\nThis is one of the most important and consequential transaction in our 50 plus history, and it accelerates our growth plan by several years.\nThe addition of Concentra elevates Equitables place among the countrys top-tier financial institutions, expands our core markets of Personal and Commercial banking including alternative, reverse single-family mortgage loans, commercial lending and equipment leasing, and furthers our standing relationship with credit unions with whom we share a strong philosophical bond.\nHeadquartered in Saskatoon, Concentra is a digital bank, which operates under the trade name Wyth Financial.\nIt caters to retail and businesses with a range of services including savings and mortgages. It also provides fintechs with banking as a service.\nAdditionally, Concentra is one of the largest providers of wholesale banking and trust solutions to Canadian credit unions.\nData, insights and analysis delivered to you\nView all newsletters\nBy the Retail Banker International team\nSign up to our newsletters\nSign up here\nConcentra president and CEO Don Coulter said: We are delighted to join Equitable in its challenger bank quest. This powerful combination of capabilities and services is right for our employees, customers and community partners and creates an opportunity for our team to excel as part of an award-winning Canadian bank that shares our commitment to innovation.\nThe board of directors of Equitable, Concentra, and SaskCentral have approved the acquisition.\nThe deal now awaits regulatory approval and is expected to close in the second half of 2022.\nEquitable Bank will fund the purchase through C$200m ($157.53m) of new equity to be secured through a bought deal offering of subscription receipts.\nThe remainder will be funded through a credit facility from a group led by TD Securities and RBC Capital Markets.\nMore from this topic","snippet":"**Equitable Bank** announced the signing of an agreement to acquire a majority stake in **Canadas** Concentra **Bank** for $370.26m.\nFebruary 8, 2022 **Equitable** signs deal to buy Canadian digital bank Concentra for $370.26m Canadian lender **Equitable Bank** has signed agreements to acquire domestic digital rival Concentra **Bank** for C$470m ($370.26m).","keywords":"","language":"en","isSafe":true,"datePublished":"2022-02-08T12:31:00","provider":{"name":"retailbankerinternational","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.retailbankerinternational.com/wp-content/uploads/sites/2/2022/02/laptop-g37c334030_1280-1038x778.png","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"retailbankerinternational","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.retailbankerinternational.com/news/equitable-digital-bank-concentra/"}},{"id":"5401563937918521092","title":"Equitable Bank Launches Its EQB Evolution Suite Of Prime Mortgage Solutions In Quebec; Now Serves Canadians Coast-to-coast - TheStreet","url":"https://www.thestreet.com/press-releases/equitable-bank-launches-its-eqb-evolution-suite-reg-of-prime-mortgage-solutions-in-quebec-now-serves-canadians-coast-to-coast-15854473","description":"TORONTO, Dec. 7, 2021 /CNW/ -Equitable Bank, Canada's Challenger Bank, announced today that it is expanding its EQB Evolution Suite prime mortgage solutions to Quebec.","body":"/CNW/ -Equitable Bank,\nCanada's\nChallenger Bank, announced today that it is expanding its EQB Evolution Suite prime mortgage solutions to\nQuebec\n.\nThe EQB Evolution Suite provides financial solutions aimed at borrowers looking to purchase a residential property. It also includes mortgage solutions for investors acquiring rental properties, newcomers to\nCanada\nwho are buying a home, and those purchasing vacation or second properties.\n\"We're pleased to now offer our full suite of prime insured mortgage solutions from coast to coast,\" said\nDamon Knights\n, Vice President of Sales and Distribution for Personal Banking at Equitable Bank. \"Providing Canadians with the right financing for their specific needs has always been our focus and we're thrilled we can now offer those same options to\nQuebec\nExpanding into\nQuebec\ncreates a seamless experience for borrowers across the country who are looking for flexible mortgage options in today's real estate market, and firmly positions Equitable as a full-service option for all Canadians.\nWhether it's taking out a mortgage for the first time or switching from another lender,\nQuebec\ncustomers can start by talking to a mortgage broker to find out what Equitable Bank's EQB Evolution Suite can do for them.\nFor more about Equitable Bank's full line of mortgage solutions, visit https://www.equitablebank.ca/mortgage-products.\nAbout Equitable Group Inc.\nEquitable Group Inc. trades on the Toronto Stock Exchange (TSX: EQB and EQB.PR.C) and serves nearly three hundred thousand Canadians through Equitable Bank,\nCanada's\nChallenger Bank. Equitable Bank has grown to become the country's eighth largest independent Schedule I bank with a clear mandate to drive real change in Canadian banking to enrich people's lives. Founded over 50 years ago, Equitable Bank provides diversified personal and commercial banking and through its EQ Bank platform (eqbank.ca) has been named #1 Bank in\nCanada\non the Forbes World's Best Banks 2021 list. Please visit equitablebank.ca for details.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nStatements made by the Company in the sections of this news release, in other filings with Canadian securities regulators and in other communications include forward-looking statements within the meaning of applicable securities laws (\"forward-looking statements\"). These statements include, but are not limited to, statements about the Company's objectives, strategies and initiatives, financial results expectations and risk management, statements about or containing possible future issuances of deposit notes of the Bank, statements made by our President and CEO and any other statements made herein, whether with respect to the Company's businesses or the Canadian economy. Generally, forward-looking statements can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"planned\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases which state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, closing of transactions, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements, including but not limited to risks related to capital markets and additional funding requirements, fluctuating interest rates and general economic conditions, legislative and regulatory developments, the nature of our customers and rates of default, and competition as well as those factors discussed under the heading \"Risk Management\" in the Management's Discussion and Analysis and in the Company's documents filed on SEDAR at www.sedar.com. All material assumptions used in making forward-looking statements are based on management's knowledge of current business conditions and expectations of future business conditions and trends, including their knowledge of the current credit, interest rate and liquidity conditions affecting the Company and the Canadian economy. Although the Company believes the assumptions used to make such statements are reasonable at this time and has attempted to identify in its continuous disclosure documents important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. Certain material assumptions are applied by the Company in making forward-looking statements, including without limitation, assumptions regarding its continued ability to fund its mortgage business at current levels, a continuation of the current level of economic uncertainty that affects real estate market conditions, continued acceptance of its products in the marketplace, as well as no material changes in its operating cost structure and the current tax regime. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements. The Company does not undertake to update any forward-looking statements that are contained herein, except in accordance with applicable securities laws.\nThis press release does not constitute an offer to sell or the solicitation of any offer to buy securities in any province, state or jurisdiction in which such offer or solicitation would be unlawful prior to registration or qualification under the securities laws of any such province, state or jurisdiction.\nThe Deposit Note has not been and will not be registered under the United States Securities Act of 1933, as amended, or any state securities laws and may not be offered or delivered, directly or indirectly, or sold in\nthe United States\nabsent an applicable exemption from the registration requirements. This press release does not constitute an offer to sell or the solicitation to buy nor shall there be any sale of the securities in any State in which such offer, solicitation or sale would be unlawful.\nSOURCE Equitable Bank","snippet":"Founded over 50 years ago, **Equitable Bank** provides diversified personal and commercial banking and through ... platform (eqbank.ca) has been named #1 **Bank** in **Canada** on the Forbes World's Best ****Bank**s** 2021 list. Please visit ...","keywords":"","language":"en","isSafe":true,"datePublished":"2021-12-07T16:30:00","provider":{"name":"thestreet","favIcon":"","favIconBase64Encoding":""},"image":{"url":"","height":0,"width":0,"thumbnail":"","thumbnailHeight":0,"thumbnailWidth":0,"base64Encoding":"","name":null,"title":null,"provider":{"name":"thestreet","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.thestreet.com/press-releases/equitable-bank-launches-its-eqb-evolution-suite-reg-of-prime-mortgage-solutions-in-quebec-now-serves-canadians-coast-to-coast-15854473"}}]}